org/ansimail.org
#+hugo_base_dir: ../
#+hugo_section: ./

* Manual DNS setup
:PROPERTIES:
:EXPORT_FILE_NAME: manualdns
:EXPORT_HUGO_SECTION*: guides
:END:
If for some reason you have decided to not /enable_nsd/ and want to do it manually,
I have outlined the necessary steps for creating records at your *DNS provider*.

** Assumptions
- Your domain name: /pdomain.abc/ (for primary domain)
- You have configured an *A record* for /ansimail.pdomain.abc/, so that it points to the current server.
- Your host server has *reverse DNS* resolving to /ansimail.pdomain.abc/.
- You are configuring dns for a secondary domain /sdomain.xyz/.\\
    (It does not need to be secondary, /sdomain.xyz/ could be the same as /pdomain.abc/)

*TTL* is the default ttl you would like to put, in AnsiMail it is set to /10800/.
** CNAME records for /sdomain.xyz/
#+begin_src
autoconfig.sdomain.xyz.          TTL IN CNAME ansimail.pdomain.abc.
autodiscover.sdomain.xyz.        TTL IN CNAME ansimail.pdomain.abc.
openpgpkey.sdomain.xyz.          TTL IN CNAME ansimail.pdomain.abc.
wkd.sdomain.xyz.                 TTL IN CNAME ansimail.pdomain.abc.
mta-sts.sdomain.xyz.             TTL IN CNAME ansimail.pdomain.abc.
imap.sdomain.xyz.                TTL IN CNAME ansimail.pdomain.abc.
pop3.sdomain.xyz.                TTL IN CNAME ansimail.pdomain.abc.
smtp.sdomain.xyz.                TTL IN CNAME ansimail.pdomain.abc.
#+end_src

** MX records for /sdomain.xyz/
#+begin_src
@                                TTL IN MX 0 ansimail.pdomain.abc.
#+end_src
This tells the world that the mail for /sdomain.xyz/ is handled by /ansimail.pdomain.abc/
** TXT records for /sdomain.xyz/
#+begin_src
sdomain.xyz.                     TTL IN TXT "v=spf1 mx:pdomain.abc -all"
_dmarc.sdomain.xyz.              TTL IN TXT "v=DMARC1;p=reject;pct=100;rua=mailto:dmarcreports@pdomain.abc"
_smtp._tls.sdomain.xyz.          TTL IN TXT "v=TLSRPTv1;rua=mailto:tlsreports@pdomain.abc;"
ansimail._domainkey.sdomain.xyz. TTL IN TXT "v=DKIM1;k=rsa;p={ANSIMAILKEY}"
#+end_src
where *{ANSIMAILKEY}* is the key stored in */etc/ansimail/dkim/ansimail.pdomain.abc.pub* 
and */etc/ansimail/dkim/ansimail.pdomain.abc.txt*.

*NOTE*: Depending on your DNS provider the key generated by AnsiMail is going to be too 
large to fit in one record. You will have to contact your DNS provider to see how 
to fit a large key into a TXT record. The work around this is to store more than one string 
in a DNS record (yes, this is possible to do, but the implementation depends on your 
hosting providers UI).\\
AnsiMail breaks down the record into correct sizes and stores it in the text files above.
#+begin_src
( "v=DKIM1;k=rsa;p=OQWcn812jW..." "....UnsdU;" )
#+end_src

** SRV records for /sdomain.xyz/
Needed for setting up older client software (and also Microsoft/iOS)
#+begin_src
_submissions._tcp.sdomain.xyz.   TTL IN SRV 0 1 465 smtp.sdomain.xyz.
_submission._tcp.sdomain.xyz.    TTL IN SRV 0 1 587 smtp.sdomain.xyz.
_imaps._tcp.sdomain.xyz.         TTL IN SRV 0 1 993 imap.sdomain.xyz.
_pop3s._tcp.sdomain.xyz.         TTL IN SRV 0 1 995 pop3.sdomain.xyz.
_imap._tcp.sdomain.xyz.          TTL IN SRV 0 0 0   .                   (OPTIONAL, depending on DNS provider compatibility)
_pop3._tcp.sdomain.xyz.          TTL IN SRV 0 0 0   .                   (OPTIONAL, depending on DNS provider compatibility)
#+end_src
** Extra SRV records for setting up openpgpkey using GnuPG
#+begin_src
_openpgpkey._tcp.sdomain.xyz.    TTL IN SRV 0 0 443 wkd.sdomain.xyz.
#+end_src
** SRV records for autodiscover in Microsoft
#+begin_src
_autodiscover._tcp.sdomain.xyz.  TTL IN SRV 0 0 443 autodiscover.sdomain.xyz.
#+end_src
