content/guides/manualdns.md
+++
title = "Manual DNS setup"
author = ["Aisha Tammy"]
draft = false
+++

If for some reason you have decided to not _enable\_nsd_ and want to do it manually,
I have outlined the necessary steps for creating records at your **DNS provider**.


## Assumptions {#assumptions}

-   Your domain name: _pdomain.abc_ (for primary domain)
-   You have configured an **A record** for _ansimail.pdomain.abc_, so that it points to the current server.
-   Your host server has **reverse DNS** resolving to _ansimail.pdomain.abc_.
-   You are configuring dns for a secondary domain _sdomain.xyz_.<br />
    (It does not need to be secondary, _sdomain.xyz_ could be the same as _pdomain.abc_)

**TTL** is the default ttl you would like to put, in AnsiMail it is set to _10800_.


## CNAME records for _sdomain.xyz_ {#cname-records-for-sdomain-dot-xyz}

```nil
autoconfig.sdomain.xyz.          TTL IN CNAME ansimail.pdomain.abc.
autodiscover.sdomain.xyz.        TTL IN CNAME ansimail.pdomain.abc.
openpgpkey.sdomain.xyz.          TTL IN CNAME ansimail.pdomain.abc.
wkd.sdomain.xyz.                 TTL IN CNAME ansimail.pdomain.abc.
mta-sts.sdomain.xyz.             TTL IN CNAME ansimail.pdomain.abc.
imap.sdomain.xyz.                TTL IN CNAME ansimail.pdomain.abc.
pop3.sdomain.xyz.                TTL IN CNAME ansimail.pdomain.abc.
smtp.sdomain.xyz.                TTL IN CNAME ansimail.pdomain.abc.
```


## MX records for _sdomain.xyz_ {#mx-records-for-sdomain-dot-xyz}

```nil
@                                TTL IN MX 0 ansimail.pdomain.abc.
```

This tells the world that the mail for _sdomain.xyz_ is handled by _ansimail.pdomain.abc_


## TXT records for _sdomain.xyz_ {#txt-records-for-sdomain-dot-xyz}

```nil
sdomain.xyz.                     TTL IN TXT "v=spf1 mx:pdomain.abc -all"
_dmarc.sdomain.xyz.              TTL IN TXT "v=DMARC1;p=reject;pct=100;rua=mailto:dmarcreports@pdomain.abc"
_smtp._tls.sdomain.xyz.          TTL IN TXT "v=TLSRPTv1;rua=mailto:tlsreports@pdomain.abc;"
ansimail._domainkey.sdomain.xyz. TTL IN TXT "v=DKIM1;k=rsa;p={ANSIMAILKEY}"
```

where **{ANSIMAILKEY}** is the key stored in **/etc/ansimail/dkim/ansimail.pdomain.abc.pub**
and **/etc/ansimail/dkim/ansimail.pdomain.abc.txt**.

**NOTE**: Depending on your DNS provider the key generated by AnsiMail is going to be too
large to fit in one record. You will have to contact your DNS provider to see how
to fit a large key into a TXT record. The work around this is to store more than one string
in a DNS record (yes, this is possible to do, but the implementation depends on your
hosting providers UI).<br />
AnsiMail breaks down the record into correct sizes and stores it in the text files above.

```nil
( "v=DKIM1;k=rsa;p=OQWcn812jW..." "....UnsdU;" )
```


## SRV records for _sdomain.xyz_ {#srv-records-for-sdomain-dot-xyz}

Needed for setting up older client software (and also Microsoft/iOS)

```nil
_submissions._tcp.sdomain.xyz.   TTL IN SRV 0 1 465 smtp.sdomain.xyz.
_submission._tcp.sdomain.xyz.    TTL IN SRV 0 1 587 smtp.sdomain.xyz.
_imaps._tcp.sdomain.xyz.         TTL IN SRV 0 1 993 imap.sdomain.xyz.
_pop3s._tcp.sdomain.xyz.         TTL IN SRV 0 1 995 pop3.sdomain.xyz.
_imap._tcp.sdomain.xyz.          TTL IN SRV 0 0 0   .                   (OPTIONAL, depending on DNS provider compatibility)
_pop3._tcp.sdomain.xyz.          TTL IN SRV 0 0 0   .                   (OPTIONAL, depending on DNS provider compatibility)
```


## Extra SRV records for setting up openpgpkey using GnuPG {#extra-srv-records-for-setting-up-openpgpkey-using-gnupg}

```nil
_openpgpkey._tcp.sdomain.xyz.    TTL IN SRV 0 0 443 wkd.sdomain.xyz.
```


## SRV records for autodiscover in Microsoft {#srv-records-for-autodiscover-in-microsoft}

```nil
_autodiscover._tcp.sdomain.xyz.  TTL IN SRV 0 0 443 autodiscover.sdomain.xyz.
```
